ruvnet/RuView/firmware/esp32-csi-node/sdkconfig.defaults.esp32c3
# Target: ESP32-C3
CONFIG_IDF_TARGET="esp32c3"

# Partition table for 4MB flash
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_4mb.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Disable Display (no GPIOs/PSRAM for it on Super Mini)
CONFIG_DISPLAY_ENABLE=n

# Disable WASM (too heavy for C3 internal RAM)
CONFIG_WASM_ENABLE=n

# RISC-V specific
CONFIG_ESP32C3_REV_MIN_3=y

# Memory optimization
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_LWIP_IRAM_OPTIMIZATION=n
CONFIG_WIFI_LWIP_ALLOCATION_FROM_SPIRAM=n
